In [31]:
!pip install sqlalchemy@1.4.32
!pip install pymysql

Defaulting to user installation because normal site-packages is not writeable

ERROR: Invalid requirement: 'sqlalchemy@1.4.32'

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pymysql in c:\users\sam\appdata\roaming\python\python39\site-packages (1.0.2)

In [3]:
import pandas as pd
import sqlalchemy
import pymysql

In [4]:
user = "pda2023"
password = "pda2023"
database = "test"

In [5]:
sqlEngine = sqlalchemy.create_engine(f"mysql+pymysql://{user}:{password}@127.0.0.1/")
conn =  sqlEngine.connect()

In [8]:
conn.execute(f"DROP DATABASE IF EXISTS {database}")
conn.execute(f"CREATE DATABASE {database};")
conn.execute(f"USE {database};")

In [9]:
df = pd.DataFrame({
    "col1": [1, 2, 3],
    "col2": [4, 5, 6]
                  })

In [10]:
df

   col1  col2
0     1     4
1     2     5
2     3     6

In [11]:
# table name, connection object
df.to_sql(database, conn)

3

In [12]:
df2 = pd.DataFrame({
    "col1": [1, 2, 3, 6, 7, 8],
    "col2": [4, 5, 6, 9, 10, 11]
                  })

In [14]:
df2.to_sql("test2", conn)

6

In [15]:
# SELECT command, conn object
dfr = pd.read_sql("SELECT * FROM test;", conn)

In [16]:
dfr

   index  col1  col2
0      0     1     4
1      1     2     5
2      2     3     6

In [17]:
# SELECT command, conn object
dfr = pd.read_sql("SELECT * FROM test;", conn, index_col="index")

In [18]:
dfr

       col1  col2
index
0         1     4
1         2     5
2         3     6

In [19]:
dfr.reset_index()

   index  col1  col2
0      0     1     4
1      1     2     5
2      2     3     6

In [20]:
df2.to_sql("test2", conn, index=False)

6

In [22]:
res = conn.execute("SELECT * FROM test;")

In [23]:
res.keys()

RMKeyView(['index', 'col1', 'col2'])

In [24]:
for result in res:
    print(result)

(0, 1, 4)
(1, 2, 5)
(2, 3, 6)

In [25]:
ge = pd.read_csv("General Electric.csv")

In [26]:
ge.head()

   Year           Company  Revenue (in millions)  Profit (in millions)
0  1955  General Electric                 2959.1                 212.6
1  1956  General Electric                 3095.4                 200.9
2  1957  General Electric                 4090.0                 213.8
3  1958  General Electric                 4335.7                 247.9
4  1959  General Electric                 4120.8                 242.9

In [27]:
ge.set_index("Year", inplace=True)

In [28]:
ge

               Company  Revenue (in millions)  Profit (in millions)
Year
1955  General Electric                 2959.1                 212.6
1956  General Electric                 3095.4                 200.9
1957  General Electric                 4090.0                 213.8
1958  General Electric                 4335.7                 247.9
1959  General Electric                 4120.8                 242.9
1960  General Electric                 4349.5                 280.2
1961  General Electric                 4197.5                 200.1
1962  General Electric                 4456.8                 242.1
1963  General Electric                 4792.7                 265.8
1964  General Electric                 4918.7                 270.6
1965  General Electric                 4941.4                 237.3
1966  General Electric                 6213.6                 355.1
1967  General Electric                 7177.3                 338.9
1968  General Electric                 7741.2                 361.4
1969  General Electric                 8381.6                 357.1
1970  General Electric                 8448.0                 278.0
1971  General Electric                 8726.7                 328.5
1972  General Electric                 9425.3                 471.8
1973  General Electric                10239.5                 530.0
1974  General Electric                11575.3                 585.1
1975  General Electric                13413.1                 608.1
1976  General Electric                13399.1                 580.8
1977  General Electric                15697.3                 930.6
1978  General Electric                17518.6                1088.2
1979  General Electric                19653.8                1229.7
1980  General Electric                22460.6                1408.8
1981  General Electric                24959.0                1514.0
1982  General Electric                27240.0                1652.0
1983  General Electric                26500.0                1817.0
1984  General Electric                26797.0                2024.0
1985  General Electric                27947.0                2280.0
1986  General Electric                28285.0                2336.0
1987  General Electric                35211.0                2492.0
1988  General Electric                39315.0                2915.0
1989  General Electric                49414.0                3386.0
1990  General Electric                55264.0                3939.0
1991  General Electric                58414.0                4303.0
1992  General Electric                60236.0                2636.0
1993  General Electric                62202.0                4725.0
1994  General Electric                60823.0                4315.0
1995  General Electric                64687.0                4726.0
1996  General Electric                70028.0                6573.0
1997  General Electric                79179.0                7280.0
1998  General Electric                90840.0                8203.0
1999  General Electric               100469.0                9296.0
2000  General Electric               111630.0               10717.0
2001  General Electric               129853.0               12735.0
2002  General Electric               125913.0               13684.0
2003  General Electric               131698.0               14118.0
2004  General Electric               134187.0               15002.0
2005  General Electric               152363.0               16593.0

In [30]:
#ge.to_sql("GE", conn)